DataProcessors/ПодписаниеПредставленияЭлектронныхДокументовПОДДляДокументовБезФормуляров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПодписаниеПредставленияЭлектронныхДокументовПОДДляДокументовБезФормуляров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоДокументовНаПодпись</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыНаПодпись</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеФормуляра</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПредставлениеФормуляраПервичногоДокументаПОД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредставлениеФормуляраПервичногоДокументаПОДПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СостоянияСформированныхПредставленийФормуляровПОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСформированныхПредставленийФормуляровПОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подписано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредставлениеФормуляра</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредставлениеФормуляраПервичногоДокументаПОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПредставлениеФормуляраПервичногоДокументаПОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПредставлениеФормуляраПервичногоДокументаПОД</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаСведений</Name>
					<Comment>1 - MXL, 2 - PDF</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяЗадачаСоздатель</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредставлениеФормуляраПервичногоДокументаПОДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФормуляра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВидаРегистраУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРегистраУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПодписаниеПредставленияЭлектронныхДокументовПОДДляДокументовБезФормуляров/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.КоличествоДокументовНаПодпись = 1000;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьЭДПредставленияФормуляров(Команда)
	ЗаполнитьЭДПредставленияФормуляровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьЭДПредставленияФормуляров(Команда)

	Если Объект.ДокументыНаПодпись.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;

	УстановитьВидимостьЭлементов(ЭтотОбъект, Ложь);
	ПодписатьПредставленияФормуляровНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокДокументовНаПодпись()
	Объект.ДокументыНаПодпись.Очистить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1000
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.Ссылка КАК ПредставлениеФормуляра,
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.ОсновнойФайл КАК ОсновнойФайл,
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.Предмет КАК Предмет,
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.КодВидаСведений КАК КодВидаСведений,
	               |	ВЫБОР
	               |		КОГДА ПредставлениеФормуляраПервичногоДокументаПОД.КодВидаСведений = 2
	               |			ТОГДА ""pdf""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПредставлениеФормуляраПервичногоДокументаПОД.КодВидаСведений = 1
	               |					ТОГДА ""mxl""
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ФорматФайла,
	               |	ВЫБОР
	               |		КОГДА СостоянияСформированныхПредставленийФормуляровПОД.Подписано = ИСТИНА
	               |			ТОГДА СостоянияСформированныхПредставленийФормуляровПОД.Подписано
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Подписано
	               |ИЗ
	               |	Документ.ПредставлениеФормуляраПервичногоДокументаПОД КАК ПредставлениеФормуляраПервичногоДокументаПОД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСформированныхПредставленийФормуляровПОД КАК СостоянияСформированныхПредставленийФормуляровПОД
	               |		ПО (СостоянияСформированныхПредставленийФормуляровПОД.ПредставлениеФормуляра = ПредставлениеФормуляраПервичногоДокументаПОД.Ссылка)
	               |ГДЕ
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.ВыполняемаяЗадачаСоздатель = &ПустаяЗадачаСоздатель
	               |	И СостоянияСформированныхПредставленийФормуляровПОД.Подписано ЕСТЬ NULL";
	Если Объект.КоличествоДокументовНаПодпись > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1000", Формат(Объект.КоличествоДокументовНаПодпись,"ЧГ="));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1000", "");
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПустаяЗадачаСоздатель", Задачи.ЗадачаПоОбработкеДокумента.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ДокументыНаПодпись.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокументПредставленияФормуляра(Результат, Параметры) Экспорт

	ДокументФормуляра = Параметры.ПредставлениеФормуляра;
	Если ЗначениеЗаполнено(ДокументФормуляра) Тогда
		ПараметрыФормы = Новый Структура("Ключ, СкрытьПрисоединенныеФайлы", ДокументФормуляра, Истина);
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ представления формуляра не найден.'"));
		Возврат;
	КонецЕсли;

	ФормаФормуляра = ОткрытьФорму("Документ.ПредставлениеФормуляраПервичногоДокументаПОД.Форма.ФормаПредставленияФормуляра", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьПредставленияФормуляровНаКлиенте()
	НаборДанных = ДанныеПредставленияФормуляров(УникальныйИдентификатор);

	Для Каждого Данные Из НаборДанных Цикл
		Если Данные.Свойство("ПредставлениеФормуляра") И ЗначениеЗаполнено(Данные.ПредставлениеФормуляра) Тогда
			Если ТипЗнч(Данные.ПредставлениеФормуляра) = Тип("ДокументСсылка.ПредставлениеФормуляраПервичногоДокументаПОД") Тогда
				Представление = СтрШаблон("%1 (%2)", Данные.Заголовок, Данные.ФорматПервичногоДокумента);
				
				ПараметрыОбработчика = Новый Структура;
				ПараметрыОбработчика.Вставить("Текст", "");
				ПараметрыОбработчика.Вставить("ПредставлениеФормуляра", Данные.ПредставлениеФормуляра);
				ПараметрыОбработчика.Вставить("Заголовок", Представление);
				ПараметрыОбработчика.Вставить("ФорматПервичногоДокумента", Данные.ФорматПервичногоДокумента);
				
				ОбработчикОткрытияФайла = Новый ОписаниеОповещения("ПоказатьДокументПредставленияФормуляра", ЭтотОбъект, ПараметрыОбработчика);
				
				Данные.Вставить("Представление", Новый Структура("Значение, Представление", ОбработчикОткрытияФайла, Представление));
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Если НаборДанных.Количество() > 1 Тогда
		Операция = НСтр("ru = 'Подпись документов'");
		ЗаголовокДанных = НСтр("ru = 'Документы'");
		ПредставлениеНабора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Документы (%1)'"), НаборДанных.Количество());
	Иначе
		Операция = НСтр("ru = 'Подпись документа'");
		ЗаголовокДанных = НСтр("ru = 'Документ'");
		ПредставлениеНабора = НаборДанных[0].Заголовок;
	КонецЕсли;

	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция", Операция);
	ОписаниеДанных.Вставить("ЗаголовокДанных", ЗаголовокДанных);
	ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
	
	ОписаниеДанных.Вставить("НаборДанных", НаборДанных);
	ОписаниеДанных.Вставить("ПредставлениеНабора", ПредставлениеНабора);

	Обработчик = Новый ОписаниеОповещения("ПродолжитьПослеЭлектроннойПодписи", ЭтотОбъект);
	ПараметрыПодписания = ЭлектроннаяПодписьКлиент.НовыйТипПодписи();
	ПараметрыПодписания.ВыборДоверенности = Истина;
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, , Обработчик, ПараметрыПодписания)
	
КонецПроцедуры

&НаСервере
Функция ДанныеПредставленияФормуляров(УИДФормы)
	НаборДанныхДляПодписи = Новый Массив;

	Для Каждого ДанныеДляПодписи Из объект.ДокументыНаПодпись Цикл
		ДанныеДокумента = Новый Структура;
		ТекЗаголовок = Документы.ПредставлениеФормуляраПервичногоДокументаПОД.ЗаголовокПредставленияФормуляра(ДанныеДляПодписи.ПредставлениеФормуляра);
		ДанныеДокумента.Вставить("Заголовок", ТекЗаголовок);
		ДанныеДокумента.Вставить("АдресТабличногоДокумента", "");
		ДанныеДокумента.Вставить("ПредставлениеФормуляра", ДанныеДляПодписи.ПредставлениеФормуляра);
		ДанныеДокумента.Вставить("УчетныйДокумент", ДанныеДляПодписи.Предмет);
		ДанныеДокумента.Вставить("ФайлДляПодписи", ДанныеДляПодписи.ОсновнойФайл);
		ДанныеДокумента.Вставить("ФорматПервичногоДокумента", ДанныеДляПодписи.ФорматФайла);
		
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Истина;
		ПараметрыДанныхФайла.ИдентификаторФормы = УИДФормы;

		ДанныеФайла = РаботаСФайлами.ДанныеФайла(ДанныеДляПодписи.ОсновнойФайл, ПараметрыДанныхФайла);
		ДанныеДокумента.Вставить("Данные", ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		
		НаборДанныхДляПодписи.Добавить(ДанныеДокумента);
	
	КонецЦикла;

	Возврат НаборДанныхДляПодписи;
КонецФункции	

&НаСервере
Процедура ЗаполнитьЭДПредставленияФормуляровНаСервере()
	ЗаполнитьСписокДокументовНаПодпись();
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПослеЭлектроннойПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успех Тогда
		
		Для Каждого ТекДанные Из Результат.НаборДанных Цикл
			ТекДанные.Удалить("АдресТабличногоДокумента");
			ТекДанные.Удалить("Данные");
			ТекДанные.Удалить("Заголовок");
			ТекДанные.Удалить("Представление");

			Если Результат.Свойство("РезультатПроверкиМЧДДляПодписания") Тогда
				Если Результат.РезультатПроверкиМЧДДляПодписания <> Неопределено Тогда
					РезультатПроверкиПодписиПоМЧД = Новый Структура;
					РезультатПроверкиПодписиПоМЧД.Вставить("ТребуетсяПроверка", Истина);
					
					ТекДанные.СвойстваПодписи.Вставить("РезультатПроверкиПодписиПоМЧД", РезультатПроверкиПодписиПоМЧД);
					Если Результат.Свойство("ВыбраннаяДоверенность") Тогда
						ТекДанные.СвойстваПодписи.РезультатПроверкиПодписиПоМЧД.Вставить("МашиночитаемаяДоверенность", Результат.ВыбраннаяДоверенность);
					КонецЕсли;
					ПротоколПроверки = Новый Соответствие;
					ПроверкаДоверенности = Новый Структура;
					ПроверкаПодписанта = Новый Структура;
					ПроверкаПолномочий = Новый Структура;
					ПроверкаДокумента = Новый Структура;
					
					Проверка = Новый Структура;
					Проверка.Вставить("Верна", Неопределено);
					Проверка.Вставить("ЗаголовокПроверки", "");
					Проверка.Вставить("ТекстПроверки", "");
					Проверка.Вставить("ДатаПроверки", Неопределено);
					Проверка.Вставить("РучнаяПроверка", Ложь);
					Проверка.Вставить("ДополнительныеДанные", Неопределено);
					
					Если Результат.РезультатПроверкиМЧДДляПодписания.Свойство("ПроверкаДоверенности") Тогда
						ПроверкаДоверенности = Результат.РезультатПроверкиМЧДДляПодписания.ПроверкаДоверенности;
					КонецЕсли;	
					Если Результат.РезультатПроверкиМЧДДляПодписания.Свойство("ПроверкаПодписанта") Тогда
						ПроверкаПодписанта = Результат.РезультатПроверкиМЧДДляПодписания.ПроверкаПодписанта;
					КонецЕсли;
						
					ПроверкаПолномочий = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Проверка);
					ПроверкаПолномочий.ЗаголовокПроверки = "Проверка полномочий";
					ПроверкаДокумента = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Проверка);
					ПроверкаДокумента.ЗаголовокПроверки = "Проверка документа";
					
					ПротоколПроверки.Вставить("ПроверкаДоверенности", ПроверкаДоверенности);
					ПротоколПроверки.Вставить("ПроверкаПодписанта", ПроверкаПодписанта);
					ПротоколПроверки.Вставить("ПроверкаПолномочий", ПроверкаПолномочий);
					ПротоколПроверки.Вставить("ПроверкаДокумента", ПроверкаДокумента);
					
					ТекДанные.СвойстваПодписи.РезультатПроверкиПодписиПоМЧД.Вставить("ПротоколПроверки", ПротоколПроверки);
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		
		ПодписатьЭлектроннойПодписью(Результат.НаборДанных);
	Иначе
		УстановитьВидимостьЭлементов(ЭтотОбъект, Истина);
		Возврат;
	КонецЕсли;

	Оповестить(ИмяСобытияОбновленияПредставленияФормуляра());
	
КонецПроцедуры

&НаСервере
Процедура ПодписатьЭлектроннойПодписью(ОписаниеДанных) Экспорт
	
	Для Каждого Данные Из ОписаниеДанных Цикл
		
		ПодписатьЭлектронныйДокумент(Данные);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяСобытияОбновленияПредставленияФормуляра() Экспорт
	Возврат "ОбновитьСостояниеПредставленияФормуляра";
КонецФункции

&НаСервере
Процедура ПодписатьЭлектронныйДокумент(Параметры) Экспорт
	
	УчетныйДокумент = Параметры.УчетныйДокумент;
	ЭлектронныйДокумент = Параметры.ПредставлениеФормуляра;
	ФайлДляПодписи = Параметры.ФайлДляПодписи;
	
	Если ТипЗнч(Параметры.СвойстваПодписи) = Тип("Строка") Тогда
		СвойстваПодписи = ПолучитьИзВременногоХранилища(Параметры.СвойстваПодписи);
	Иначе
		СвойстваПодписи = Параметры.СвойстваПодписи;
	КонецЕсли;
	
	Подписант = СвойстваПодписи.УстановившийПодпись;
	ДатаИзменения = СвойстваПодписи.ДатаПодписи;
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьРегистрСостоянияПредставленияФормуляров(ЭлектронныйДокумент);

		ДобавитьЭлектроннуюПодпись(ФайлДляПодписи, СвойстваПодписи);

		УстановитьСостояниеПодписанДляПредставленияФормуляра(ЭлектронныйДокумент);

		ЗафиксироватьТранзакцию()
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеПодписанДляПредставленияФормуляра(ПредставлениеФормуляра)

	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СостоянияСформированныхПредставленийФормуляровПОД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредставлениеФормуляра.Установить(ПредставлениеФормуляра);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ПредставлениеФормуляра = ПредставлениеФормуляра;
	Запись.Подписано = Истина;
	
	НаборЗаписей.Записать();

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьРегистрСостоянияПредставленияФормуляров(ПредставленияФормуляров) Экспорт
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Если ТипЗнч(ПредставленияФормуляров) = Тип("Массив") Тогда
			Для Каждого ПредставлениеФормуляра Из ПредставленияФормуляров Цикл
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияСформированныхПредставленийФормуляровПОД");
				ЭлементБлокировки.УстановитьЗначение("ПредставлениеФормуляра", ПредставлениеФормуляра);
			КонецЦикла;
		Иначе
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияСформированныхПредставленийФормуляровПОД");
			ЭлементБлокировки.УстановитьЗначение("ПредставлениеФормуляра", ПредставленияФормуляров);
		КонецЕсли;
		Блокировка.Заблокировать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлектроннуюПодпись(ФайлДляПодписи, СвойстваПодписи)
	
	ЭлектроннаяПодпись.ДобавитьПодпись(ФайлДляПодписи, СвойстваПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = ИмяСобытияОбновленияПредставленияФормуляра() Тогда
		ЗаполнитьЭДПредставленияФормуляровНаСервере();
		УстановитьВидимостьЭлементов(ЭтотОбъект, Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма, РазрешитьПодписание)
	Объект = Форма.Объект;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КоличествоДокументовНаПодпись", "Доступность", РазрешитьПодписание);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ЗаполнитьЭДПредставленияФормуляров", "Доступность", РазрешитьПодписание);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ПодписатьЭДПредставленияФормуляров", "Доступность", РазрешитьПодписание);
	
КонецПроцедуры
	
#КонецОбласти
